# Примерни стойности:
# 2. Според проучванията трябват 21 секунди да се мият ръцете, за да се премахне Covid вируса от тях. Напишете програма, която калкулира колко време
# отделяме за това занимание. Програмата трябва да има:
# * Функция, която прави калкулацията, връща резултата и извежда на екрана. Приема 2 параметъра: колко пъти на ден мием ръцете и колко месеца го изпълняваме.
# * Изведената информация трябва да е в МИНУТИ
# Приемете, че всеки месец е с 30 дни
# Шаблон на функцията
def wash_hands(n, months):
    time = n * months * 30 * 21
    print(time)
n = int(input)
months = int(input)
wash_hands(n, months)